In [0]:
import os
# changing directory to Google Drive Folder (when using Google Colab)
os.chdir('/content/drive/My Drive/ANN/hw1')

In [0]:
import pandas as pd
import numpy as np
import tensorflow as tf
from tensorflow import keras

## Part 1 and 2

loding and preprocessing the data

In [0]:
# loading dataset
dataset_path = "dataset/adult.data"

df = pd.read_csv(dataset_path, header=None)

# Define dataset headers
df.columns = ["age", "workclass", "fnlwgt", "education", "education-num", "marital-status", "occupation", "relationship",
          "race", "sex", "capital-gain", "capital-loss", "hours-per-week", "native-country", "label"]

In [4]:
df.head()

   age          workclass  fnlwgt  ... hours-per-week  native-country   label
0   39          State-gov   77516  ...             40   United-States   <=50K
1   50   Self-emp-not-inc   83311  ...             13   United-States   <=50K
2   38            Private  215646  ...             40   United-States   <=50K
3   53            Private  234721  ...             40   United-States   <=50K
4   28            Private  338409  ...             40            Cuba   <=50K

[5 rows x 15 columns]

In [0]:
# converting nominal data to numeric
# We define a dictionary to assign each nominal value to a numeric value

nominal_to_numeric = {
    'workclass' : {'Private':0, 'Self-emp-not-inc':1, 'Self-emp-inc':2, 'Federal-gov':3,
                   'Local-gov':4, 'State-gov':5, 'Without-pay':6, 'Never-worked':7},

    'education' : {'Bachelors':0, 'Some-college':1, '11th':2, 'HS-grad':3, 
                   'Prof-school':4, 'Assoc-acdm':5, 'Assoc-voc':6, '9th':7, '7th-8th':8,
                   '12th':9, 'Masters':10, '1st-4th':11, '10th':12, 'Doctorate':13,
                   '5th-6th':14, 'Preschool':15},

    'marital-status' : {'Married-civ-spouse':0, 'Divorced':1, 'Never-married':2,
                        'Separated':3, 'Widowed':4, 'Married-spouse-absent':5, 
                        'Married-AF-spouse':6},
                      
    'occupation' : {'Tech-support':0, 'Craft-repair':1, 'Other-service':2, 'Sales':3,
                    'Exec-managerial':4, 'Prof-specialty':5, 'Handlers-cleaners':6, 
                    'Machine-op-inspct':7, 'Adm-clerical':8, 'Farming-fishing':9, 
                    'Transport-moving':10, 'Priv-house-serv':11, 'Protective-serv':12, 
                    'Armed-Forces':13},

    'relationship': {'Wife':0, 'Own-child':1, 'Husband':2, 'Not-in-family':3,
                     'Other-relative':4, 'Unmarried':5},

    'race': {'White':0, 'Asian-Pac-Islander':1, 'Amer-Indian-Eskimo':2, 'Other':3,
             'Black':4},

    'sex': {'Female':0, 'Male':1},

    'native-country': {'United-States':0, 'Cambodia':1, 'England':2, 'Puerto-Rico':3, 
                       'Canada':4, 'Germany':5, 'Outlying-US(Guam-USVI-etc)':6, 
                       'India':7, 'Japan':8, 'Greece':9, 'South':10, 'China':11, 
                       'Cuba':12, 'Iran':13, 'Honduras':14, 'Philippines':15, 'Italy':16, 
                       'Poland':17, 'Jamaica':18, 'Vietnam':19, 'Mexico':20, 'Portugal':21, 
                       'Ireland':22, 'France':23, 'Dominican-Republic':24, 'Laos':26, 
                       'Ecuador':27, 'Taiwan':28, 'Haiti':29, 'Columbia':30, 'Hungary':31, 
                       'Guatemala':32, 'Nicaragua':33, 'Scotland':34, 'Thailand':35, 
                       'Yugoslavia':36, 'El-Salvador':37, 'Trinadad&Tobago':38, 'Peru':39, 
                       'Hong':40, 'Holand-Netherlands':41},

    'label': {'<=50K':0, '>50K': 1}
}

In [0]:
df_numeric = df.replace(nominal_to_numeric, regex=True)

In [17]:
df_numeric.head()

   age workclass  fnlwgt  ...  hours-per-week  native-country  label
0   39         5   77516  ...              40               0      0
1   50         1   83311  ...              13               0      0
2   38         0  215646  ...              40               0      0
3   53         0  234721  ...              40               0      0
4   28         0  338409  ...              40              12      0

[5 rows x 15 columns]